/* Localizable strings */

"kCantSaveTitle" = "Unable to save changes.";
"kOKButtonTitle" = "OK";
"kCancelButtonTitle" = "Cancel";

"kBasicTabTitle" =									"Basic";
"kBasicCantSaveEmptyRealNameMsg" = 					"The real name is empty. Please fill in a value for the real name.";
"kBasicCantSavePassAndVerifyDontMatch" =			"The password and verify fields must be the same.";
"kBasicCantSaveEmptyRecordName" =					"The first short name is empty. Please fill in a value for the first short name.";
"kBasicCantSaveEmptyUIDMsg" =						"The ID is empty. The ID must be specified.";
"kBasicIDAlreadyInUse" =							"This ID is already assigned to another user.";
"kBasicIDAlreadyInUseMsg" =							"Are you sure you want to give this user the same ID?";
"kBasicRootUIDSelected" =							"The specified user ID belongs to the System Administrator (root) user.";
"kBasicRootUIDSelectedMsg" =						"Using this ID will give the user all of the priviliges of the System Administrator. Doing this can be extremely detrimental to the security of this server. Are you sure you want to use this user ID?";
"kBasicSystemUIDSelected" =							"The ID is less than 500.";
"kBasicSystemUIDSelectedMsg" =						"IDs less than 500 are usually reserved for system-related users and groups. Assigning such an ID may have unexpected security implications. Additionally, Workgroup Manager doesn't show users and groups with IDs less than 500 unless \"Show System Users and Groups\" is selected in the View menu.";
"kBasicShortNameAlreadyInUse" =						"The name you have chosen conflicts with a name assigned to another user.";
"kBasicShortNameAlreadyInUseMgs" =					"You can’t assign the name “%@” to two different users. Remember that names are not case-sensitive when checking for conflicts.";
"kBasicEmptyPassword" =								"You have designated an empty password.";
"kBasicEmptyPasswordMsg" =							"This user will not require a password to log in.";
"kBasicDupeShortNamesNotAllowed" =					"Duplicate short name.";
"kBasicDupeShortNamesNotAllowedMsg" =				"This user already has “%@” for a short name. Users can’t have two of the same short name.";

"kAdvancedTabTitle" =								"Advanced";
"kMissingConfigRecord" =							"You must set up the Password Server before using it. Use Server Admin to do so.";
"kCantFindPWordServerTitle" =						"Missing Config Record";
"kAdvancedDefaultShellMenuitem" =					"Default";
"kAdvancedPasswordServerPwdType" =					"Open Directory";
"kAdvancedCryptPwdType" =							"Crypt Password";
"kAdvancedShadowHashPwdType" =						"Shadow Password";

"kGroupTabTitle" =									"Groups";
"kGroupCantSaveEmptyGID" =							"The primary group ID must be specified.";
"kGroupCloseDrawerButtonName" =						"Close";
"kGroupNoPrimaryGroupSummary" =						"No Primary Group";
"kGroupLookingUpInherited" =						"Finding groups…";
"kGroupUpdateInheritedTimeFormat" =					"%m/%d/%y, %I:%M %p";
"kGroupLastUpdatedInheritedFormat" =				"Updated on %@";
"kGroupNoInheritedGroups" =							"No inherited groups found.";

"kPrintTabTitle" =									"Print";
"untitled" =										"untitled";
"unlimited" =										"unlimited";
"kNonePrintingSummary" =							"None";
"Enabled for Specific Queue(s)" =					"Enabled for Specific Queue(s)";
"Enabled -- %@ pages every %@ days" =				"Enabled - %@ pages every %@ days";
"kNoQueueName" =									"You must specify a queue name.";
"kNoPrintServerName" =								"You must specify a print server.";

"kVolumesTabTitle" =								"Home";
"kVolumesCantSaveEmptyHomeDirPath" =				"The home directory path must be specified.";
"kVolumesCantSaveEmptyHomeDirServer" =				"The home directory server must be specified.";
"kVolumesCantSaveEmptyHomeDirSharePoint" =			"The home directory share point must be specified.";
"kVolumesCantSaveEmptyHomeDirHomeAttribute" =		"The home attribute must be specified.";
"kVolumesNoHomeDirSummary" =						"No Home Directory";
"kVolumesCantSaveNonetworkMountPointMsg" =			"A home directory mount point must be specified.";
"kVolumesCantSaveInvalidURL" =						"“%@” is not a valid home directory URL. “afp://server.company.com/Users” is an example of what a valid home directory URL looks like.";
"kVolumesNoneHomeDirItem" =							"(None)";
"kVolumesSureToDeleteHomeDirItem" =					"Permanently delete this item?";
"kVolumesSureToDeleteHomeDirItemMsg" =				"Are you sure you want to permanently delete “%@” from the list of home directory options? This action can not be undone. This action will not affect other users’ home directory settings; nor will it alter any files on disk.";
"kVolumesDeleteHomeDirItem" =						"Delete";
"kVolumesDontDeleteHomeDirItem" =					"Don’t Delete";

"Mail"="Mail";
"Quota Started: %@"="Quota Started: %@";
"OK"="OK";
"Unable to save changes."="Unable to save changes.";
"Forwarding address does not seem to be a valid email address."="Forwarding address does not seem to be a valid email address.";
"Mail server field is empty, please type in a valid mail server and resave."="A mail server must be specified";
"unknown server"="unknown server";
"unknown address"="unknown address";
"No mail service for this user"="No mail service for this user";
"Enabled at %@"="Enabled at %@";
"Mail forwarded to %@"="Mail forwarded to %@";
"Can only disable login in the future"="You can only disable login on a particular date at a future date. To disable login right now, uncheck the Allow Login checkbox.";

"kSummaryInfoNotAvailable" =						"Not Available";
"Wrong Login" = "Cannot set record to Open Directory because you are not an Open Directory password server administrator.";
"NotAPassWordServerAdmin" = "In order to select Open Directory, your own password type must be Open Directory. Administrators with other password types cannot set a user’s password type to Open Directory.";
"kPWordTooShort" = "The password is too short.";

"kCantSetPasswordTitle" =							"The password could not be set.";
"kPasswordTooShort" =								"The entered password is too short. All other settings were saved.";
"kPasswordTooLong" =								"The entered password is too long. All other settings were saved.";
"kPasswordNeedsLetter" =							"The password requires at least one letter. All other settings were saved.";
"kPasswordNeedsDigit" =								"The password requires at least one digit. All other settings were saved.";
"kPasswordNotODAdmin" =								"In order to set the password of a a user with an Open Directory Password, your own password type must be Open Directory. Administrators with other password types cannot set the password of a user with an Open Directory password.";
"kPasswordQualityCheckFailed" =						"The entered password does not meet the minimum requirements configured for this server. Please verify the password policies and try again.";
"kPasswordErrorOccurred" =							"An unexpected error of type %d occurred. All other settings were saved.";

"kWindowsTabTitle" =								"Windows";
"kInfoTabTitle" =									"Info";
"kPrivilegesTabTitle" =								"Privileges";
"kInfoTabGivenNameIsFirst" =						"1";
"kFullPath" =                                       "Full Path:";
"kHomeURL" =                                        "Home URL:";
"kNoCalendarHostSelected" =					"No Calendar Host Selected";

"kCantCreateHomeDirectoryTitle"	=					"Unable to create home directory.";
"kCantCreateHomeDirectoryMsg" =						"The home directory could not be created because an error occurred.";

